
#Область Пример
// Пример использования на форме объекта:
//```
//#Область ОбработчикиСобытийФормы

//&НаСервере
//Процедура WK_ПриЧтенииНаСервереПосле(ТекущийОбъект)
//	
//	WK_УстановитьНастройкиФормы();
//	
//КонецПроцедуры

//&НаСервере
//Процедура WK_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
//	
//	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
//		
//		Объект.EX_Обмен             = Ложь;
//		Объект.TSD_Доступен   = Ложь;
//		Объект.WK_ПриоритетОтгрузки = 0;
//		
//		WK_УстановитьНастройкиФормы();
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура WK_ПриОткрытииПосле(Отказ)
//	
//	EX_ОбновитьКнопкуОбмен();
//	
//КонецПроцедуры

//#КонецОбласти

//#Область ОбработчикиКомандФормы

//&НаКлиенте
//Процедура EX_ВключитьВОбмен(Команда)
//	
//	Если ЗначениеЗаполнено(Объект.Ссылка) И Не Модифицированность Тогда
//		
//		Если Объект.EX_Обмен Тогда
//			EX_ОбменДанными.ИсключитьЭлементСправочникаИзОбмена(Объект.Ссылка);
//		Иначе
//			EX_ОбменДанными.ВключитьЭлементСправочникаВОбмен(Объект.Ссылка);
//		КонецЕсли;
//		
//		Прочитать();
//		
//	Иначе
//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначала запишите этот элемент");
//	КонецЕсли;
//	
//	EX_ОбновитьКнопкуОбмен();
//	
//КонецПроцедуры

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Процедура WK_УстановитьНастройкиФормы()
//	
//	ДопСвойстваФлаг = Новый Структура("ПоложениеЗаголовка", ПоложениеЗаголовкаЭлементаФормы.Право);
//	
//	WK_ПриоритетОтгрузки = ВКМ_ФормыВызовСервера.ДобавитьПоле(ЭтотОбъект, "Объект.WK_ПриоритетОтгрузки", "WK_ПриоритетОтгрузки",,,, Элементы.ОсновноеПраво);
//	
//	Если WK_ВызовСервераПовтИсп.ЗначениеПараметра("ИспользоватьОбщееAPI") = Истина Тогда
//		EX_ВыгружатьОстатки = ВКМ_ФормыВызовСервера.ДобавитьПоле(ЭтотОбъект, "Объект.EX_ВыгружатьОстатки", "EX_ВыгружатьОстатки", "Выгружать остатки по API", Истина,, Элементы.ОсновноеПраво);
//	КонецЕсли;
//	
//	WK_РазбиватьРасходныеОрдераПоРаспоряжениям = ВКМ_ФормыВызовСервера.ДобавитьПоле(ЭтотОбъект, "Объект.WK_РазбиватьРасходныеОрдераПоРаспоряжениям", "WK_РазбиватьРасходныеОрдераПоРаспоряжениям",, Истина,, Элементы.ОрдернаяСхемаЛево,, ДопСвойстваФлаг);
//	
//	TSD_Доступен = ВКМ_ФормыВызовСервера.ДобавитьПоле(ЭтотОбъект, "Объект.TSD_Доступен", "TSD_Доступен",, Истина,, Элементы.ОрдернаяСхемаЛево,, ДопСвойстваФлаг);
//	
//	Если Не ТолькоПросмотр Тогда
//		
//		EX_ВключитьВОбменКоманда = ВКМ_ФормыВызовСервера.ДобавитьКоманду(ЭтотОбъект, "EX_ВключитьВОбмен", "EX_ВключитьВОбмен", "Включить в обмен", БиблиотекаКартинок.ПланОбмена);
//		
//		EX_ВключитьВОбменКнопка = ВКМ_ФормыВызовСервера.ДобавитьКнопку(ЭтотОбъект, "EX_ВключитьВОбмен", "EX_ВключитьВОбмен",, Элементы.ФормаКоманднаяПанель);
//		EX_ВключитьВОбменКнопка.Видимость   = EX_ПараметрыВызовСервераПовтИсп.ВыполнятьОбменСОбщейБазой();
//		EX_ВключитьВОбменКнопка.Доступность = РольДоступна("ПолныеПрава") Или РольДоступна("WK_КонтентМенеджерСайта");
//		
//	КонецЕсли;
//	
//	Если Объект.EX_Обмен Тогда
//		EX_ОбщегоНазначенияВызовСервера.ЗаблокироватьЭлементыФормыНоменклатуры(ЭтотОбъект);
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура EX_ОбновитьКнопкуОбмен()
//	
//	Если Элементы.Найти("EX_ВключитьВОбмен") = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Элементы.EX_ВключитьВОбмен.Доступность = EX_ПараметрыВызовСервераПовтИсп.ЕстьПраваНаОбмен();
//	
//	Если Объект.EX_Обмен Тогда
//		Элементы.EX_ВключитьВОбмен.Заголовок = "Исключить из обмена";
//	Иначе
//		Элементы.EX_ВключитьВОбмен.Заголовок = "Включить в обмен";
//	КонецЕсли;
//	
//КонецПроцедуры

//#КонецОбласти
//```
#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ДобавитьГруппу(Форма, Имя, Заголовок = "", Вертикальная = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = СоздатьОбычнуюГруппу(Форма, ВидГруппыФормы.ОбычнаяГруппа, Имя, Заголовок, Вертикальная, Родитель, Расположение, ДопСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьГруппуСтраниц(Форма, Имя, Заголовок = "", Вертикальная = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = СоздатьОбычнуюГруппу(Форма, ВидГруппыФормы.Страницы, Имя, Заголовок, Вертикальная, Родитель, Расположение, ДопСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьГруппуКолонок(Форма, Имя, Заголовок = "", Вертикальная = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = СоздатьОбычнуюГруппу(Форма, ВидГруппыФормы.ГруппаКолонок, Имя, Заголовок, Вертикальная, Родитель, Расположение, ДопСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьГруппуКнопок(Форма, Имя, Заголовок = "",
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = СоздатьОбычнуюГруппу(Форма, ВидГруппыФормы.ГруппаКнопок, Имя, Заголовок, Ложь, Родитель, Расположение, ДопСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьСтраницу(Форма, Имя, Заголовок = "", Вертикальная = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = СоздатьОбычнуюГруппу(Форма, ВидГруппыФормы.Страница, Имя, Заголовок, Вертикальная, Родитель, Расположение, ДопСвойства);
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьТаблицу(Форма, ПутьКДанным, Имя, Заголовок = "",
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = Форма.Элементы.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Форма;
	КонецЕсли;
	
	Результат = Форма.Элементы.Добавить(Имя, Тип("ТаблицаФормы"), Родитель);
	Результат.Отображение = ОтображениеТаблицы.Список;
	Результат.ПутьКДанным = ПутьКДанным;
	
	Если ТипЗнч(ДопСвойства) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДопСвойства);
	КонецЕсли;
	
	Если Расположение <> Неопределено Тогда
		Форма.Элементы.Переместить(Результат, Родитель, Расположение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьПоле(Форма, ПутьКДанным, Имя, Заголовок = "", ПолеФлажка = Ложь, ПолеНадписи = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = Форма.Элементы.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Форма;
	КонецЕсли;
	
	Вид = ВидПоляФормы.ПолеВвода;
	
	Если ПолеФлажка Тогда
		Вид = ВидПоляФормы.ПолеФлажка;
	ИначеЕсли ПолеНадписи Тогда
		Вид = ВидПоляФормы.ПолеНадписи;
	КонецЕсли;
	
	Результат = Форма.Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель);
	Результат.Вид         = Вид;
	Результат.Заголовок   = Заголовок;
	Результат.ПутьКДанным = ПутьКДанным;
	
	Если ТипЗнч(ДопСвойства) = Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(Результат, ДопСвойства);
		
		Если ДопСвойства.Свойство("ЗаголовокВПодсказкуВвода") Тогда
			Результат.ПодсказкаВвода     = Заголовок;
			Результат.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет
		КонецЕсли;
		
	КонецЕсли;
	
	Если Расположение <> Неопределено Тогда
		Форма.Элементы.Переместить(Результат, Родитель, Расположение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьПолеКартинки(Форма, ПутьКДанным, Имя, Заголовок = "", Гиперссылка = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = Форма.Элементы.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Форма;
	КонецЕсли;
	
	Результат = Форма.Элементы.Добавить(Имя, Тип("ПолеФормы"), Родитель);
	
	Результат.Вид         = ВидПоляФормы.ПолеКартинки;
	Результат.Заголовок   = Заголовок;
	Результат.ПутьКДанным = ПутьКДанным;
	Результат.Гиперссылка = Гиперссылка;
	
	Если ТипЗнч(ДопСвойства) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДопСвойства);
	КонецЕсли;
	
	Если Расположение <> Неопределено Тогда
		Форма.Элементы.Переместить(Результат, Родитель, Расположение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьНадпись(Форма, Имя, Заголовок = "",
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = Форма.Элементы.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Форма;
	КонецЕсли;
	
	Результат = Форма.Элементы.Добавить(Имя, Тип("ДекорацияФормы"), Родитель);
	
	Результат.Вид       = ВидДекорацииФормы.Надпись;
	Результат.Заголовок = Заголовок;
	
	Если ТипЗнч(ДопСвойства) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДопСвойства);
	КонецЕсли;
	
	Если Расположение <> Неопределено Тогда
		Форма.Элементы.Переместить(Результат, Родитель, Расположение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьКартинку(Форма, Имя, Картинка, Гиперссылка = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = Форма.Элементы.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Форма;
	КонецЕсли;
	
	Результат = Форма.Элементы.Добавить(Имя, Тип("ДекорацияФормы"), Родитель);
	
	Результат.Вид = ВидДекорацииФормы.Картинка;
	
	Если ЗначениеЗаполнено(Картинка) Тогда
		Результат.Картинка = Картинка;
	КонецЕсли;
	
	Результат.Гиперссылка = Гиперссылка;
	
	Если ТипЗнч(ДопСвойства) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДопСвойства);
	КонецЕсли;
	
	Если Расположение <> Неопределено Тогда
		Форма.Элементы.Переместить(Результат, Родитель, Расположение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьКоманду(Форма, Имя, Действие, Заголовок = "", Картинка = Неопределено) Экспорт
	
	Результат = Форма.Команды.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Форма.Команды.Добавить(Имя);
	Результат.Действие  = Действие;
	Результат.Заголовок = Заголовок;
	
	Если Картинка <> Неопределено Тогда
		Результат.Картинка    = Картинка;
		Результат.Отображение = ОтображениеКнопки.КартинкаИТекст;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДобавитьКнопку(Форма, Имя, ИмяКоманды, Гиперссылка = Ложь,
	Родитель = Неопределено, Расположение = Неопределено, ДопСвойства = Неопределено) Экспорт
	
	Результат = Форма.Элементы.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Форма;
	КонецЕсли;
	
	Результат = Форма.Элементы.Добавить(Имя, Тип("КнопкаФормы"), Родитель);
	
	Результат.ИмяКоманды  = ИмяКоманды;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "Гиперссылка") Тогда
		Результат.Гиперссылка = Гиперссылка;
	КонецЕсли;
	
	Если ТипЗнч(ДопСвойства) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДопСвойства);
	КонецЕсли;
	
	Если Расположение <> Неопределено Тогда
		Форма.Элементы.Переместить(Результат, Родитель, Расположение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция СоздатьОбычнуюГруппу(Форма, Вид, Имя, Заголовок, Вертикальная, Родитель, Расположение, ДопСвойства)
	
	Результат = Форма.Элементы.Найти(Имя);
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Родитель = Форма;
	КонецЕсли;
	
	Результат = Форма.Элементы.Добавить(Имя, Тип("ГруппаФормы"), Родитель);
	
	Результат.Вид       = Вид;
	Результат.Заголовок = Заголовок;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "ОтображатьЗаголовок") Тогда
		Результат.ОтображатьЗаголовок = ЗначениеЗаполнено(Заголовок);
	КонецЕсли;
	
	Если Вид <> ВидГруппыФормы.ГруппаКнопок Тогда
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Результат, "Группировка") Тогда
			
			Если ТипЗнч(Результат.Группировка) = Тип("ГруппировкаКолонок") Тогда
				Результат.Группировка = ?(Вертикальная, ГруппировкаКолонок.Вертикальная, ГруппировкаКолонок.Горизонтальная);
			Иначе
				Результат.Группировка = ?(Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.Вертикальная, ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(ДопСвойства) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(Результат, ДопСвойства);
	КонецЕсли;
	
	Если Расположение <> Неопределено Тогда
		Форма.Элементы.Переместить(Результат, Родитель, Расположение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
