#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	СписокРеквизитов   = "ВКМ_ДатаНачалаДействия, ВКМ_ДатаОкончанияДействия, ВКМ_СтоимостьЧасаРаботыСпециалиста";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор, СписокРеквизитов);
	
	Если ДатаПроведенияРабот < ЗначенияРеквизитов.ВКМ_ДатаНачалаДействия
		Или ДатаПроведенияРабот > ЗначенияРеквизитов.ВКМ_ДатаОкончанияДействия Тогда
		
		ВызватьИсключение СтрШаблон("Дата проведения работ вне срока действия договора %1-%2",
			Формат(ЗначенияРеквизитов.ВКМ_ДатаНачалаДействия, "ДФ=dd.MM.yyyy"),
			Формат(ЗначенияРеквизитов.ВКМ_ДатаОкончанияДействия, "ДФ=dd.MM.yyyy"));
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЗначенияРеквизитов.ВКМ_СтоимостьЧасаРаботыСпециалиста) Тогда
		ВызватьИсключение "Не заполнен реквизит договора 'Стоимость часа работы специалиста'";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Период",    НачалоМесяца(ДатаПроведенияРабот));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК Т";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение СтрШаблон("Для специалиста %1 не установлен процент оплаты от работ", Специалист);
	КонецЕсли;
	
	СтавкаЧаса     = ЗначенияРеквизитов.ВКМ_СтоимостьЧасаРаботыСпециалиста;
	ПроцентОтРабот = Выборка.ПроцентОтРабот;
	
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	
	Для Каждого СтрокаВыполненныхРабот Из ВыполненныеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период          = ДатаПроведенияРабот;
		Движение.Клиент          = Клиент;
		Движение.Договор         = Договор;
		Движение.КоличествоЧасов = СтрокаВыполненныхРабот.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате    = СтрокаВыполненныхРабот.ЧасыКОплатеКлиенту * СтавкаЧаса;
		
	КонецЦикла;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	
	Для Каждого СтрокаВыполненныхРабот Из ВыполненныеРаботы Цикл
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период       = ДатаПроведенияРабот;
		Движение.Сотрудник    = Специалист;
		Движение.ЧасовКОплате = СтрокаВыполненныхРабот.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = СтрокаВыполненныхРабот.ЧасыКОплатеКлиенту * СтавкаЧаса * ПроцентОтРабот / 100;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
