#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РассчитатьНДФЛ();
	ЗаполнитьДвиженияНачислений();
	ЗаполнитьДвиженияВзаиморасчетов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РассчитатьНДФЛ()
	
	КоэффициентНДФЛ = Константы.ВКМ_ПроцентНДФЛ.КоэффициентНДФЛ();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		Строка.НДФЛ = Окр(Строка.СуммаПремии * КоэффициентНДФЛ, 2);
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияНачислений()
	
	ПланВидовРасчетаПремия = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
	ПланВидовРасчетаНДФЛ   = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода  = КонецМесяца(Дата);
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_ДополнительныеНачисления.Очистить();
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_Удержания.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		ДвиженияПремия = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		ДвиженияПремия.ПериодРегистрации = НачалоПериода;
		ДвиженияПремия.ВидРасчета        = ПланВидовРасчетаПремия;
		ДвиженияПремия.Сотрудник         = Строка.Сотрудник;
		ДвиженияПремия.Результат         = Строка.СуммаПремии;
		
		ДвиженияНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвиженияНДФЛ.ПериодРегистрации = НачалоПериода;
		ДвиженияНДФЛ.ВидРасчета        = ПланВидовРасчетаНДФЛ;
		ДвиженияНДФЛ.Сотрудник         = Строка.Сотрудник;
		ДвиженияНДФЛ.Результат         = Строка.НДФЛ;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДвиженияВзаиморасчетов()
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	Для Каждого Строка Из СписокСотрудников Цикл
		
		СуммаКВыплате = Строка.СуммаПремии - Строка.НДФЛ;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период      = Дата;
		Движение.Сотрудник   = Строка.Сотрудник;
		Движение.Сумма       = СуммаКВыплате;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
