
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДанных = Параметры.АдресДанных;
	Год         = Параметры.Год;
	
	ДанныеОтпусков = ПолучитьИзВременногоХранилища(АдресДанных);
	УдалитьИзВременногоХранилища(АдресДанных);
	
	ЗаполнитьДиаграммуГанта(ДанныеОтпусков);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуГанта(ДанныеОтпусков)
	
	Диаграмма.Очистить();
	
	Если ДанныеОтпусков = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТочкиСотрудников = Новый Соответствие;
	Для Каждого Запись Из ДанныеОтпусков Цикл
		
		Если ТочкиСотрудников[Запись.Сотрудник] = Неопределено Тогда
			Точка       = Диаграмма.УстановитьТочку(Строка(Запись.Сотрудник));
			Точка.Текст = Строка(Запись.Сотрудник);
			ТочкиСотрудников.Вставить(Запись.Сотрудник, Точка);
		КонецЕсли;
		
	КонецЦикла;
	
	Серия       = Диаграмма.УстановитьСерию("Отпуск");
	Серия.Текст = "Плановый отпуск";
	
	Для Каждого Запись Из ДанныеОтпусков Цикл
		
		Если Не ЗначениеЗаполнено(Запись.ДатаНачала) Или Не ЗначениеЗаполнено(Запись.ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;
		
		Значение = Диаграмма.ПолучитьЗначение(ТочкиСотрудников[Запись.Сотрудник], Серия);
		
		Интервал        = Значение.Добавить();
		Интервал.Начало = Запись.ДатаНачала;
		Интервал.Конец  = КонецДня(Запись.ДатаОкончания);
		Интервал.Текст  = Строка(Запись.Сотрудник);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
