#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	НаборЗаписей = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Год.Установить(Год);
	
	Для Каждого СтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.Год           = Год;
		Запись.Сотрудник     = СтрокаОтпускаСотрудников.Сотрудник;
		Запись.ДатаНачала    = СтрокаОтпускаСотрудников.ДатаНачала;
		Запись.ДатаОкончания = СтрокаОтпускаСотрудников.ДатаОкончания;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
