
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ОбновитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()
	
	ВКМ_Видимость = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
	
	Элементы.ВКМ_ДатаОкончанияДействия.Видимость            = ВКМ_Видимость;
	Элементы.ВКМ_СуммаЕжемесячнойАбонентскойПлаты.Видимость = ВКМ_Видимость;
	Элементы.ВКМ_СтоимостьЧасаРаботыСпециалиста.Видимость   = ВКМ_Видимость;
	Элементы.ВКМ_ДатаНачалаДействия.Видимость               = ВКМ_Видимость;
	
КонецПроцедуры

#КонецОбласти
